wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_hs.c
/** @file stm32f4xx_usb_fs.c
 * \brief Driver for STM32F4x5/4x7 device
 *
 * This driver is written according to STM32F4x5_4x7 reference manual
 * (ref. RM0090) Rev 11.
 **/

#include "autoconf.h"
#ifdef CONFIG_USR_DRV_USB_HS

#include "stm32f4xx_usb_hs.h"
#include "stm32f4xx_usb_hs_regs.h"
#include "api/usb_control.h"
#include "libc/syscall.h"
#include "libc/stdio.h"
#include "libc/nostd.h"
#include "libc/string.h"

#define ZERO_LENGTH_PACKET 0
#define OUT_NAK		0x01
#define DataOUT		0x02
#define Data_Done	0x03
#define SETUP_Done	0x04
#define SETUP		0x06

#define USB_REG_CHECK_TIMEOUT 50

#define USB_HS_RX_FIFO_SZ 	512
#define USB_HS_TX_FIFO_SZ	512

#define USB_HS_DEBUG 0

#if USB_HS_DEBUG
#define log_printf(...) aprintf(__VA_ARGS__)
#else
#define log_printf(...) {};
#endif


/**
 * \struct setup_packet
 * \brief Setup packet, used to transfer data on EP0
 */
static struct {
	void (*data_sent_callback)(void);
	void (*data_received_callback)(uint32_t);
} usb_hs_callbacks;

static uint8_t 	setup_packet[8];


static volatile uint8_t *buffer_ep0;
static volatile uint32_t buffer_ep0_idx;
static volatile uint32_t buffer_ep0_size;
static volatile uint8_t *buffer_ep1;
static volatile uint32_t buffer_ep1_idx;
static volatile uint32_t buffer_ep1_size;

#define USB_MAX_ISR 32

/******* Helpers to handle delays *****************/
/* [RB] FIXME: these are quick and dirty ways of 'delaying',
 * we should migrate to cleaner ways asap ...
 */

/* Get ticks/time in milliseconds */
static uint64_t platform_get_ticks(void){
    uint64_t tick = 0;
        sys_get_systick(&tick, PREC_MILLI);
        return tick;
}

/* Fixed delay of a given number of milliseconds */
static void delay_ms(uint32_t ms_delay){
        unsigned long long start_tick, curr_tick;

        start_tick = platform_get_ticks();
        /* Now wait */
        curr_tick = start_tick;
        while((curr_tick - start_tick) <= ms_delay){
                curr_tick = platform_get_ticks();
        }

        return;
}


/**************************************************/


static usb_ep_error_t usb_hs_driver_TXFIFO_flush(uint8_t ep){
	uint32_t count = 0;
	/* Select which ep to flush and do it
 	 * This is the FIFO number that must be flushed using the TxFIFO Flush bit.
 	 * This field must not be changed until the core clears the TxFIFO Flush bit.
 	 */
	count = 0;
    	while (get_reg(r_CORTEX_M_USB_HS_GRSTCTL, USB_HS_GRSTCTL_TXFFLSH)){
    		if (++count > USB_REG_CHECK_TIMEOUT){
    			log_printf("HANG! Waiting for the core to clear the TxFIFO Flush bit GRSTCTL:TXFFLSH\n");
		}
		return USB_ERROR_BUSY;
	}
	/*
	 * The application must write this bit only after checking that the core is neither writing to the
	 * TxFIFO nor reading from the TxFIFO. Verify using these registers:
	 */

	/* FIXME Read: the NAK effective interrupt ensures the core is not reading from the FIFO */

	/* Write: the AHBIDL bit in OTG_HS_GRSTCTL ensures that the core is not writing anything to the FIFO */
	set_reg(r_CORTEX_M_USB_HS_GRSTCTL, ep, USB_HS_GRSTCTL_TXFNUM);
	set_reg(r_CORTEX_M_USB_HS_GRSTCTL, 1, USB_HS_GRSTCTL_TXFFLSH);
	count = 0;
	while (get_reg(r_CORTEX_M_USB_HS_GRSTCTL, USB_HS_GRSTCTL_TXFFLSH)){
        	if (++count > USB_REG_CHECK_TIMEOUT){
		    log_printf("HANG! Waiting for the core to clear the TxFIFO Flush bit GRSTCTL:TXFFLSH\n");
		}
        	return USB_ERROR_BUSY;
	}
	return 0;
}

static usb_ep_error_t usb_hs_driver_TXFIFO_flush_all(void){
	unsigned int ep;
	usb_ep_error_t ret;

	/* [RB]: FIXME: put a macro defining the number of endpoints */
	for(ep = 0; ep < 4; ep++){
		if((ret = usb_hs_driver_TXFIFO_flush(ep)) != USB_OK){
			return ret;
		}
	}
	return USB_OK;
}

static usb_ep_error_t usb_hs_driver_RXFIFO_flush(void){
    uint32_t count = 0;
	/* Select which ep to flush and do it
     * This is the FIFO number that must be flushed using the TxFIFO Flush bit.
     * This field must not be changed until the core clears the TxFIFO Flush bit.
     */
    count = 0;
	while (get_reg(r_CORTEX_M_USB_HS_GRSTCTL, USB_HS_GRSTCTL_RXFFLSH)){
        if (++count > USB_REG_CHECK_TIMEOUT){
		    log_printf("HANG! Waiting for the core to clear the TxFIFO Flush bit GRSTCTL:RXFFLSH\n");
	}
        return USB_ERROR_BUSY;
    }
    /*
     * The application must write this bit only after checking that the core is neither writing to the
     * RxFIFO nor reading from the RxFIFO. Verify using these registers:
     */

    /* FIXME Read: the NAK effective interrupt ensures the core is not reading from the FIFO */

    /* Write: the AHBIDL bit in OTG_HS_GRSTCTL ensures that the core is not writing anything to the FIFO */
	//set_reg(r_CORTEX_M_USB_HS_GRSTCTL, ep, USB_HS_GRSTCTL_RXFNUM);
	set_reg(r_CORTEX_M_USB_HS_GRSTCTL, 1, USB_HS_GRSTCTL_RXFFLSH);
    count = 0;
	while (get_reg(r_CORTEX_M_USB_HS_GRSTCTL, USB_HS_GRSTCTL_RXFFLSH)){
        if (++count > USB_REG_CHECK_TIMEOUT)
		    log_printf("HANG! Waiting for the core to clear the RxFIFO Flush bit GRSTCTL:TXFFLSH\n");
        return USB_ERROR_BUSY;
    }
    return 0;
}


void usb_hs_driver_device_connect(void){
    set_reg(r_CORTEX_M_USB_HS_DCTL, 0, USB_HS_DCTL_SDIS);
}

/**
 *
 * The powered state can be exited by software with the soft disconnect feature. The DP pullup
 * resistor is removed by setting the soft disconnect bit in the device control register (SDIS
 * bit in OTG_HS_DCTL), causing a device disconnect detection interrupt on the host side
 * even though the USB cable was not really removed from the host port.
 */
void usb_hs_driver_device_disconnect(void){
    set_reg(r_CORTEX_M_USB_HS_DCTL, 1, USB_HS_DCTL_SDIS);
}

static const char *name = "usb-otg-hs";


void OTG_HS_IRQHandler(uint8_t irq __UNUSED, // IRQ number
                       uint32_t sr,  // content of posthook.status,
                       uint32_t dr);  // content of posthook.data)

static int      dev_desc = 0;

void usb_hs_driver_map(void)
{
    uint8_t ret;
    ret = sys_cfg(CFG_DEV_MAP, dev_desc);
    if (ret != SYS_E_DONE) {
        log_printf("Unable to map USB device !!!\n");
    }
}

static uint8_t usb_device_early_init(void) {

