wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_hs.c
    e_syscall_ret ret = 0;
    device_t dev;
    memset((void*)&dev, 0, sizeof(device_t));

    memcpy(dev.name, name, strlen(name));
    dev.address = USB_OTG_HS_BASE;
    dev.size = 0x4000;
    dev.irq_num = 1;
    /* device is mapped voluntary and will be activated after the full
     * authentication sequence
     */
    dev.map_mode = DEV_MAP_VOLUNTARY;


    /* IRQ configuration */
    dev.irqs[0].handler = OTG_HS_IRQHandler;
    dev.irqs[0].irq = OTG_HS_IRQ; /* starting with STACK */
    dev.irqs[0].mode = IRQ_ISR_FORCE_MAINTHREAD; /* if ISR force MT immediat execution, use FORCE_MAINTHREAD instead of STANDARD, and activate FISR permission */

    /*
     * IRQ posthook configuration
     * The posthook is executed at the end of the IRQ handler mode, *before* the ISR.
     * It permit to clean potential status registers (or others) that may generate IRQ loops
     * while the ISR has not been executed.
     * register read can be saved into 'status' and 'data' and given to the ISR in 'sr' and 'dr' argument
     */
    dev.irqs[0].posthook.status = 0x0014; /* SR is first read */
    dev.irqs[0].posthook.data = 0x0018; /* Data reg  is 2nd read */


    dev.irqs[0].posthook.action[0].instr = IRQ_PH_READ;
    dev.irqs[0].posthook.action[0].read.offset = 0x0014;


    dev.irqs[0].posthook.action[1].instr = IRQ_PH_READ;
    dev.irqs[0].posthook.action[1].read.offset = 0x0018;


    dev.irqs[0].posthook.action[2].instr = IRQ_PH_MASK;
    dev.irqs[0].posthook.action[2].mask.offset_dest = 0x14; /* MASK register offset */
    dev.irqs[0].posthook.action[2].mask.offset_src = 0x14; /* MASK register offset */
    dev.irqs[0].posthook.action[2].mask.offset_mask = 0x18; /* MASK register offset */
    dev.irqs[0].posthook.action[2].mask.mode = 0; /* no binary inversion */


    dev.irqs[0].posthook.action[3].instr = IRQ_PH_AND;
    dev.irqs[0].posthook.action[3].and.offset_dest = 0x18; /* MASK register offset */
    dev.irqs[0].posthook.action[3].and.offset_src = 0x14; /* MASK register offset */
    dev.irqs[0].posthook.action[3].and.mask = USB_HS_GINTMSK_RXFLVLM_Msk; /* MASK register offset */
    dev.irqs[0].posthook.action[3].and.mode = 1; /* binary inversion */


    dev.irqs[0].posthook.action[4].instr = IRQ_PH_AND;
    dev.irqs[0].posthook.action[4].and.offset_dest = 0x18; /* MASK register offset */
    dev.irqs[0].posthook.action[4].and.offset_src = 0x14; /* MASK register offset */
    dev.irqs[0].posthook.action[4].and.mask = USB_HS_GINTMSK_IEPINT_Msk; /* MASK register offset */
    dev.irqs[0].posthook.action[4].and.mode = 1; /* binary inversion */


    dev.irqs[0].posthook.action[5].instr = IRQ_PH_AND;
    dev.irqs[0].posthook.action[5].and.offset_dest = 0x18; /* MASK register offset */
    dev.irqs[0].posthook.action[5].and.offset_src = 0x14; /* MASK register offset */
    dev.irqs[0].posthook.action[5].and.mask = USB_HS_GINTMSK_OEPINT_Msk; /* MASK register offset */
    dev.irqs[0].posthook.action[5].and.mode = 1; /* binary inversion */



    /* Now let's configure the GPIOs */
    dev.gpio_num = 13;

	/* ULPI_D0 */
    dev.gpios[0].mask         = GPIO_MASK_SET_MODE | GPIO_MASK_SET_PUPD | GPIO_MASK_SET_TYPE | GPIO_MASK_SET_SPEED | GPIO_MASK_SET_AFR;
    dev.gpios[0].kref.port    = usb_otg_hs_dev_infos.gpios[USB_HS_ULPI_D0].port;
    dev.gpios[0].kref.pin     = usb_otg_hs_dev_infos.gpios[USB_HS_ULPI_D0].pin; /* 3 */
    dev.gpios[0].mode         = GPIO_PIN_ALTERNATE_MODE;
    dev.gpios[0].pupd         = GPIO_NOPULL;
    dev.gpios[0].type         = GPIO_PIN_OTYPER_PP;
    dev.gpios[0].speed        = GPIO_PIN_VERY_HIGH_SPEED;
    dev.gpios[0].afr          = GPIO_AF_OTG_HS;

	/* ULPI_CLK */
    dev.gpios[1].mask         = GPIO_MASK_SET_MODE | GPIO_MASK_SET_PUPD | GPIO_MASK_SET_TYPE | GPIO_MASK_SET_SPEED | GPIO_MASK_SET_AFR;
    dev.gpios[1].kref.port    = usb_otg_hs_dev_infos.gpios[USB_HS_ULPI_CLK].port;
    dev.gpios[1].kref.pin     = usb_otg_hs_dev_infos.gpios[USB_HS_ULPI_CLK].pin; /* 3 */
    dev.gpios[1].mode         = GPIO_PIN_ALTERNATE_MODE;
    dev.gpios[1].pupd         = GPIO_NOPULL;
    dev.gpios[1].type         = GPIO_PIN_OTYPER_PP;
    dev.gpios[1].speed        = GPIO_PIN_VERY_HIGH_SPEED;
    dev.gpios[1].afr          = GPIO_AF_OTG_HS;

    for (uint8_t i = USB_HS_ULPI_D1; i <= USB_HS_ULPI_D7; ++i) {
        /* INFO: for this loop to work, USB_HS_ULPI_D1 must start at index 2
         * in the JSON file */
        /* ULPI_Di */
        dev.gpios[i].mask         = GPIO_MASK_SET_MODE | GPIO_MASK_SET_PUPD | GPIO_MASK_SET_TYPE | GPIO_MASK_SET_SPEED | GPIO_MASK_SET_AFR;
        dev.gpios[i].kref.port    = usb_otg_hs_dev_infos.gpios[i].port;
        dev.gpios[i].kref.pin     = usb_otg_hs_dev_infos.gpios[i].pin;
        dev.gpios[i].mode         = GPIO_PIN_ALTERNATE_MODE;
        dev.gpios[i].pupd         = GPIO_NOPULL;
        dev.gpios[i].type         = GPIO_PIN_OTYPER_PP;
        dev.gpios[i].speed        = GPIO_PIN_VERY_HIGH_SPEED;
        dev.gpios[i].afr          = GPIO_AF_OTG_HS;
    }

    /* ULPI_STP */
    dev.gpios[9].mask         = GPIO_MASK_SET_MODE | GPIO_MASK_SET_PUPD | GPIO_MASK_SET_TYPE | GPIO_MASK_SET_SPEED | GPIO_MASK_SET_AFR;
    dev.gpios[9].kref.port    = usb_otg_hs_dev_infos.gpios[USB_HS_ULPI_STP].port;
    dev.gpios[9].kref.pin     = usb_otg_hs_dev_infos.gpios[USB_HS_ULPI_STP].pin; /* 3 */
    dev.gpios[9].mode         = GPIO_PIN_ALTERNATE_MODE;
    dev.gpios[9].pupd         = GPIO_NOPULL;
    dev.gpios[9].type         = GPIO_PIN_OTYPER_PP;
    dev.gpios[9].speed        = GPIO_PIN_VERY_HIGH_SPEED;
    dev.gpios[9].afr          = GPIO_AF_OTG_HS;

    /* ULPI_DIR */
    dev.gpios[10].mask         = GPIO_MASK_SET_MODE | GPIO_MASK_SET_PUPD | GPIO_MASK_SET_TYPE | GPIO_MASK_SET_SPEED | GPIO_MASK_SET_AFR;
    dev.gpios[10].kref.port    = usb_otg_hs_dev_infos.gpios[USB_HS_ULPI_DIR].port;
    dev.gpios[10].kref.pin     = usb_otg_hs_dev_infos.gpios[USB_HS_ULPI_DIR].pin; /* 3 */
    dev.gpios[10].mode         = GPIO_PIN_ALTERNATE_MODE;
    dev.gpios[10].pupd         = GPIO_NOPULL;
    dev.gpios[10].type         = GPIO_PIN_OTYPER_PP;
    dev.gpios[10].speed        = GPIO_PIN_VERY_HIGH_SPEED;
    dev.gpios[10].afr          = GPIO_AF_OTG_HS;

    /* ULPI_NXT */
    dev.gpios[11].mask         = GPIO_MASK_SET_MODE | GPIO_MASK_SET_PUPD | GPIO_MASK_SET_TYPE | GPIO_MASK_SET_SPEED | GPIO_MASK_SET_AFR;

    dev.gpios[11].kref.port    = usb_otg_hs_dev_infos.gpios[USB_HS_ULPI_NXT].port;
    dev.gpios[11].kref.pin     = usb_otg_hs_dev_infos.gpios[USB_HS_ULPI_NXT].pin; /* 3 */
    dev.gpios[11].mode         = GPIO_PIN_ALTERNATE_MODE;
    dev.gpios[11].pupd         = GPIO_NOPULL;
    dev.gpios[11].type         = GPIO_PIN_OTYPER_PP;
    dev.gpios[11].speed        = GPIO_PIN_VERY_HIGH_SPEED;
    dev.gpios[11].afr          = GPIO_AF_OTG_HS;

    /* Reset */
    dev.gpios[12].mask         = GPIO_MASK_SET_MODE | GPIO_MASK_SET_PUPD | GPIO_MASK_SET_TYPE | GPIO_MASK_SET_SPEED | GPIO_MASK_SET_AFR;

    dev.gpios[12].kref.port    = usb_otg_hs_dev_infos.gpios[USB_HS_RESET].port;
    dev.gpios[12].kref.pin     = usb_otg_hs_dev_infos.gpios[USB_HS_RESET].pin; /* 3 */
    dev.gpios[12].mode         = GPIO_PIN_OUTPUT_MODE;
    dev.gpios[12].pupd         = GPIO_PULLUP;//GPIO_PULLDOWN;
    dev.gpios[12].type         = GPIO_PIN_OTYPER_PP;
    dev.gpios[12].speed        = GPIO_PIN_VERY_HIGH_SPEED;
    dev.gpios[12].afr          = GPIO_AF_OTG_HS;



    ret = sys_init(INIT_DEVACCESS, &dev, &dev_desc);
    return ret;
}

static uint16_t size_from_mpsize(usb_ep_t *ep){
    if(ep == NULL){
        return 0;
    }
    if (ep->max_packet_size == USB_HS_D0EPCTL_MPSIZ_64BYTES){
        return 64;
    }
    if (ep->max_packet_size == USB_HS_D0EPCTL_MPSIZ_32BYTES){
        return 32;
    }
    if (ep->max_packet_size == USB_HS_D0EPCTL_MPSIZ_16BYTES){
        return 16;
    }
    if (ep->max_packet_size == USB_HS_D0EPCTL_MPSIZ_8BYTES){
        return 8;
    }
    return ep->max_packet_size;
}


/**********/

/**
 * \brief IN Endpoint activation
 *
 *    This section describes the steps required to activate a device endpoint or to configure an
 *    existing device endpoint to a new type.
 *    1. Program the characteristics of the required endpoint into the following fields of the
 *    OTG_HS_DIEPCTLx register (for IN or bidirectional endpoints)
 *      – Maximum packet size
 *      – USB active endpoint = 1
 *      – Endpoint start data toggle (for interrupt and bulk endpoints)
 *      – Endpoint type
 *      – TxFIFO number
 *
 *    2. Once the endpoint is activated, the core starts decoding the tokens addressed to that
 *    endpoint and sends out a valid handshake for each valid token received for the
 *    endpoint.
 *
 */
usb_ep_error_t usb_hs_driver_in_endpoint_activate(usb_ep_t *ep)
{
    /* Sanitization check */
    if (!ep) {
        log_printf("EP%d is not initialized \n", ep->num);
        return USB_ERROR_BAD_INPUT;
    }

    /* Checking if enpoint is already active */
    if (get_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep->num), USB_HS_DIEPCTL_EPENA)) {
        return USB_ERROR_ALREADY_ACTIVE;
    }

	/* Maximum packet size */
    if ((size_from_mpsize(ep) <= 0) || size_from_mpsize(ep) > MAX_DATA_PACKET_SIZE(ep->num)) {
        log_printf("EP%d bad maxpacket size: %d\n", ep->num, size_from_mpsize(ep));
        return USB_ERROR_RANGE;
    }

	set_reg_value(r_CORTEX_M_USB_HS_DIEPCTL(ep->num), ep->max_packet_size,
                                                      USB_HS_DIEPCTL_MPSIZ_Msk(ep->num),
                                                      USB_HS_DIEPCTL_MPSIZ_Pos(ep->num));
    /* Define endpoint type */
    if (ep->type == USB_HS_DXEPCTL_EPTYP_ISOCHRO) {
        log_printf("EP%d Isochronous is not suported yet\n", ep->num);
        return USB_ERROR_NOT_SUPORTED;
    }

	set_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep->num), ep->type, USB_HS_DIEPCTL_EPTYP);


    /* Endpoint start data toggle (for interrupt and bulk endpoints)
     * The application uses the SD0PID/SD1PID register fields to program either DATA0 or DATA1 PID.
     *   0: DATA0
     *   1: DATA1
     */
    if ((ep->type == USB_HS_DXEPCTL_EPTYP_INT) || (ep->type == USB_HS_DXEPCTL_EPTYP_BULK)){
        if (ep->start_data_toggle == USB_HS_DXEPCTL_SD0PID_SEVNFRM) {
	        set_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep->num), 1, USB_HS_DIEPCTL_SD0PID);
        }else{
            set_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep->num), 1, USB_HS_DIEPCTL_SD1PID);
        }
    }

