wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_hs.c
    /* USB active endpoint
     * Indicates whether this endpoint is active in the current configuration and interface. The core
     * clears this bit for all endpoints (other than EP 0) after detecting a USB reset. After receiving
     * the SetConfiguration and SetInterface commands, the application must program endpoint registers
     * accordingly and set this bit.
     */
	set_reg_bits(r_CORTEX_M_USB_HS_DIEPCTL(ep->num), USB_HS_DIEPCTL_USBAEP_Msk);


    /*  IN endpoint FIFOx transmit RAM start address
     *  XXX sould be set by user ?
     */
     /* FIXME add an allocator allowing to compact memory without holes*/
	set_reg(r_CORTEX_M_USB_HS_DIEPTXF(ep->num), (128 * 4)*ep->num + (128 * 4)*2, USB_HS_DIEPTXF_INEPTXSA);


    /*  IN endpoint TxFIFO depth
     *  XXX sould be set by user ?
     */
	set_reg(r_CORTEX_M_USB_HS_DIEPTXF(ep->num), 128, USB_HS_DIEPTXF_INEPTXFD);

    /* Clearing the NAK bit for the endpoint */
    set_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep->num), ep->num, USB_HS_DIEPCTL_CNAK);


    /* Unmask IN endpoint global interrupt */
	set_reg_bits(r_CORTEX_M_USB_HS_GINTMSK, USB_HS_GINTMSK_IEPINT_Msk);

    /* IN EP interrupt mask bits
     *   The OTG_HS_DAINTMSK register works with the Device endpoint interrupt register to
     *   interrupt the application when an event occurs on a device endpoint.
     *   However, the OTG_HS_DAINT register bit corresponding to that interrupt is still set.
     */
	write_reg_value(r_CORTEX_M_USB_HS_DAINTMSK, USB_HS_DAINTMSK_IEPM(ep->num));

    return USB_OK;
}

/**
 * \brief Out Endpoint deactivation
 *
 *    This section describes the steps required to deactivate an existing endpoint.
 *    1. In the endpoint to be deactivated, clear the USB active endpoint bit in the
 *       OTG_HS_DIEPCTLx register (for IN or bidirectional endpoints) or the
 *       OTG_HS_DOEPCTLx register (for OUT or bidirectional endpoints).
 *    2. Once the endpoint is deactivated, the core ignores tokens addressed to that endpoint,
 *       which results in a timeout on the USB.
 *
 *    Note: The application must meet the following conditions to set up the device core to handle
 *          traffic: NPTXFEM and RXFLVLM in the OTG_HS_GINTMSK register must be cleared
 */
usb_ep_error_t usb_hs_driver_out_endpoint_deactivate(uint8_t ep){

    /* Sanitization check */
    if ((ep <= 0) || (ep > 3)) {
        return USB_ERROR_BAD_INPUT;
    }

    /* Checking if enpoint is active */
    if (get_reg(r_CORTEX_M_USB_HS_DOEPCTL(ep), USB_HS_DOEPCTL_EPENA)) {
        set_reg(r_CORTEX_M_USB_HS_DOEPCTL(ep), 1, USB_HS_DOEPCTL_EPENA);
        set_reg(r_CORTEX_M_USB_HS_DOEPCTL(ep), 1, USB_HS_DOEPCTL_SNAK);
	    set_reg(r_CORTEX_M_USB_HS_DOEPCTL(ep), 1, USB_HS_DOEPCTL_EPDIS);
    }
    return USB_OK;
}

/**
 * \brief IN Endpoint deactivation
 *
 *    This section describes the steps required to deactivate an existing endpoint.
 *    1. In the endpoint to be deactivated, clear the USB active endpoint bit in the
 *       OTG_HS_DIEPCTLx register (for IN or bidirectional endpoints) or the
 *       OTG_HS_DOEPCTLx register (for OUT or bidirectional endpoints).
 *    2. Once the endpoint is deactivated, the core ignores tokens addressed to that endpoint,
 *       which results in a timeout on the USB.
 *
 *    Note: The application must meet the following conditions to set up the device core to handle
 *          traffic: NPTXFEM and RXFLVLM in the OTG_HS_GINTMSK register must be cleared
 */
usb_ep_error_t usb_hs_driver_in_endpoint_deactivate(uint8_t ep){

    /* Sanitization check */
    if ((ep <= 0) || (ep > 3)) {
        return USB_ERROR_BAD_INPUT;
    }

    /* Checking if enpoint is active */
    if (get_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep), USB_HS_DIEPCTL_EPENA)) {
        set_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep), 1, USB_HS_DIEPCTL_EPENA);
	    set_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep), 1, USB_HS_DIEPCTL_SNAK);
	    set_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep), 1, USB_HS_DIEPCTL_EPDIS);

    }
    return USB_OK;
}



/**
 * \brief Nack OUT endpoint
 *
 * @param ep Endpoint
 */
void usb_hs_driver_global_nack_out(){
	/* Put core in Global OUT NAK mode
     *   A write to this field sets the Global OUT NAK.
     *   The application uses this bit to send a NAK handshake on all OUT endpoints.
     *
     *   FIXME The application must set the this bit only after making sure that the Global OUT NAK
     *   effective bit in the Core interrupt register (GONAKEFF bit in OTG_HS_GINTSTS) is cleared.
     */
	set_reg(r_CORTEX_M_USB_HS_DCTL, 1, USB_HS_DCTL_SGONAK);

}


/**
 * \brief Nack OUT endpoint
 *
 * @param ep Endpoint
 */
void usb_hs_driver_clear_global_nack_out(){
	/* A write to this field clears the Global OUT NAK. */
	set_reg(r_CORTEX_M_USB_HS_DCTL, 1, USB_HS_DCTL_CGONAK);

}


/**
 * \brief Nack IN endpoint
 *
 * @param ep Endpoint
 */
void usb_hs_driver_global_nack_in(){
	/* Set global IN NAK
	 *   A write to this field sets the Global non-periodic IN NAK.The application uses this bit to send
	 *   a NAK handshake on all non-periodic IN endpoints.
	 *   The application must set this bit only after making sure that the Global IN NAK effective bit
	 *   in the Core interrupt register (GINAKEFF bit in OTG_HS_GINTSTS) is cleared.
	 */
	set_reg(r_CORTEX_M_USB_HS_DCTL, 1, USB_HS_DCTL_SGINAK);
}


/**
 * \brief Nack IN endpoint
 *
 * @param ep Endpoint
 */
void usb_hs_driver_clear_global_nack_in(){

	/* A write to this field clears the Global IN NAK. */
	set_reg(r_CORTEX_M_USB_HS_DCTL, 1, USB_HS_DCTL_CGINAK);

}


/**
 * \brief Stall OUT endpoint
 *
 * @param ep Endpoint
 */
void usb_hs_driver_stall_out(uint8_t ep){

    /* Wait for current transmission to END */
    while (get_reg_value(r_CORTEX_M_USB_HS_DOEPCTL(ep), USB_HS_DOEPCTL_EPENA_Msk, USB_HS_DOEPCTL_EPENA_Pos)){
        continue; //FIXME TIMEOUT
    }
	/* Disable OUT EP and set STALL bit */
	set_reg(r_CORTEX_M_USB_HS_DOEPCTL(ep), 1, USB_HS_DOEPCTL_EPDIS);
	set_reg(r_CORTEX_M_USB_HS_DOEPCTL(ep), 1, USB_HS_DOEPCTL_STALL);

	/* Clear STALL bit when app is ready */
	/* On Ctrl 0, this is done when request or data are received */
}


/**
 * \brief Stall IN endpoint
 *
 * @param ep Endpoint
 */
usb_ep_error_t usb_hs_driver_stall_in(uint8_t ep){

