wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_hs.c
    /* Wait for current transmission to END */
    //while (get_reg_value(r_CORTEX_M_USB_HS_DIEPCTL(ep), USB_HS_DIEPCTL_EPENA_Msk, USB_HS_DIEPCTL_EPENA_Pos)){
    //    continue; //FIXME TIMEOUT
    //}
    int count = 0;
	while (get_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep), USB_HS_DIEPCTL_EPENA)){
        if (++count > USB_REG_CHECK_TIMEOUT){
		    log_printf("HANG! DIEPCTL:EPENA\n");
	}
        return USB_ERROR_BUSY;
    }

	/* Disable IN EP and set STALL bit */
	set_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep), 1, USB_HS_DIEPCTL_EPDIS);
	set_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep), 1, USB_HS_DIEPCTL_STALL);

	/* Assert on Endpoint Disabled interrupt */
	//assert(read_reg_value(r_CORTEX_M_USB_HS_DIEPINT(ep)) & USB_HS_DIEPINT_EPDISD_Msk);

	/* Flush transmit FIFO
	 * p1279 Rev14 RM0090
	 * Read NAK Eff Int and write AHBIL bit
	 */
	//while (read_reg_value(r_CORTEX_M_USB_HS_GINTSTS) & USB_HS_GINTSTS_GINAKEFF_Msk);
        count = 0;
	while (get_reg(r_CORTEX_M_USB_HS_GINTSTS, USB_HS_GINTSTS_GINAKEFF)){
        	if (++count > USB_REG_CHECK_TIMEOUT){
		    log_printf("HANG! GINTSTS:GINAKEFF\n");
		}
      	  return USB_ERROR_BUSY;
    	}

	set_reg(r_CORTEX_M_USB_HS_GRSTCTL, 1, USB_HS_GRSTCTL_AHBIDL);

	/* Select which ep to flush and do it */
	set_reg(r_CORTEX_M_USB_HS_GRSTCTL, ep, USB_HS_GRSTCTL_TXFNUM);
	set_reg(r_CORTEX_M_USB_HS_GRSTCTL, 1, USB_HS_GRSTCTL_TXFFLSH);

	/* Clear STALL bit */
	/* On Ctrl 0, this is done when request is received */
    return 0;
}


/**
 *
 */
void usb_hs_driver_stall_in_clear(uint8_t ep, uint8_t type, uint8_t start_data_toggle){

	/* Clear STALL bit */
	set_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep), 0, USB_HS_DIEPCTL_STALL);

    /* Reset PID */
    if ((type == USB_HS_DXEPCTL_EPTYP_INT) || (type == USB_HS_DXEPCTL_EPTYP_BULK)){
        if (start_data_toggle == USB_HS_DXEPCTL_SD0PID_SEVNFRM) {
	        set_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep), 1, USB_HS_DIEPCTL_SD0PID); /* DATA0 */
        }else{
            set_reg(r_CORTEX_M_USB_HS_DIEPCTL(ep), 1, USB_HS_DIEPCTL_SD1PID); /* DATA1 */
        }
    }
}

/**
 *
 */
void usb_hs_driver_stall_out_clear(uint8_t ep, uint8_t type, uint8_t start_data_toggle){

	/* Clear STALL bit */
	set_reg(r_CORTEX_M_USB_HS_DOEPCTL(ep), 0, USB_HS_DIEPCTL_STALL);

	/* Reset PID */
	if ((type == USB_HS_DXEPCTL_EPTYP_INT) || (type == USB_HS_DXEPCTL_EPTYP_BULK)){
 		if (start_data_toggle == USB_HS_DXEPCTL_SD0PID_SEVNFRM) {
	        	set_reg(r_CORTEX_M_USB_HS_DOEPCTL(ep), 1, USB_HS_DOEPCTL_SD0PID); /* DATA0 */
        	}else{
            		set_reg(r_CORTEX_M_USB_HS_DOEPCTL(ep), 1, USB_HS_DOEPCTL_SD1PID); /* DATA1 */
        	}
    	}
}

/**
 * \brief USB On-the-Go core RESET
 *
 */
static usb_ep_error_t usb_otg_hs_core_reset(void)
{

    int count = 0;
	/* Wait for AHB master idle */
	while (!get_reg(r_CORTEX_M_USB_HS_GRSTCTL, USB_HS_GRSTCTL_AHBIDL)){
	        if (++count > USB_REG_CHECK_TIMEOUT){
			log_printf("HANG! AHB Idle GRSTCTL:AHBIDL\n");
		}
		return USB_ERROR_BUSY;
    }

	/* Core soft reset */
	set_reg(r_CORTEX_M_USB_HS_GRSTCTL, 1, USB_HS_GRSTCTL_CSRST);
	while (get_reg(r_CORTEX_M_USB_HS_GRSTCTL, USB_HS_GRSTCTL_CSRST)){
        	if (++count > USB_REG_CHECK_TIMEOUT){
			log_printf("HANG! Core Soft RESET\n");
        	}
        	return USB_ERROR_BUSY;
	}

	/* Wait for 3 PHY Clocks */
	unsigned int i;
	for (i = 0; i < 0xff; i++)
		continue;
    return 0;
}


void usb_otg_hs_core_init(void)
{
	uint32_t reg_value;

	/****  USB_HS_GCCFG ****/
	/* Clear PWDN */
	clear_reg_bits(r_CORTEX_M_USB_HS_GCCFG, USB_HS_GCCFG_PWRDWN_Msk);

	/*** Initialize the core ULPI interface ****/
	reg_value = read_reg_value(r_CORTEX_M_USB_HS_GUSBCFG);
	/* Use the internal VBUS */
	clear_reg_bits(&reg_value, USB_HS_GUSBCFG_ULPIEVBUSD_Msk);
	/* Data line pulsing using utmi_txvalid */
	clear_reg_bits(&reg_value, USB_HS_GUSBCFG_TSDPS_Msk);
	/* ULPI interface selection */
	set_reg_bits(&reg_value, USB_HS_GUSBCFG_UTMISEL_Msk);
	/* ULPI Physical interface is 8 bits */
	clear_reg_bits(&reg_value, USB_HS_GUSBCFG_PHYIF_Msk);
	/* DDRSEL at single data rate */
	clear_reg_bits(&reg_value, USB_HS_GUSBCFG_DDRSEL_Msk);

	clear_reg_bits(&reg_value, USB_HS_GUSBCFG_ULPIFSLS_Msk);
	clear_reg_bits(&reg_value, USB_HS_GUSBCFG_ULPICSM_Msk);

	write_reg_value(r_CORTEX_M_USB_HS_GCCFG, reg_value);

	/**** Reset after a PHY select ******/
	usb_otg_hs_core_reset();

	/**** TODO: DMA enable when necessary ****/


	/**** TODO: optional OTG mode needs additional init *****/
}


static void core_soft_reset(void)
{
	int16_t timeout;
	uint32_t reg_value = 0x00000000;
	unsigned short i;

	log_printf("[USB HS] %s\n", __FUNCTION__);
	set_reg_bits(r_CORTEX_M_USB_HS_GRSTCTL, USB_HS_GRSTCTL_CSRST_Msk);

    	__asm("DSB");

	for (i = 0; i < 0xfff; i++)
		continue; /* FIXME: Wait for 3 PHY Clock (3µs) */

	/* Wait that reset finish */
    	timeout = 0xFF;
	do {
		log_printf("[USB HS] %s: Wait that reset finish: %d\n", __FUNCTION__, timeout);
		//if (--timeout < 0)
		//	printf("Wait that reset finish timeout !");
		reg_value = get_reg(r_CORTEX_M_USB_HS_GRSTCTL, USB_HS_GRSTCTL_CSRST);
		//FIXME: delay(10); feature to add (active (user) & passive (kernel) support needed
		delay_ms(10);
	} while (reg_value == 1);

    	/* Wait for AHB master idle */
	timeout = 20;
	do {
		log_printf("[USB HS] %s: Wait for AHB Idle: %d\n", __FUNCTION__, timeout);
		//if (--timeout < 0)
		//	printf("Wait for AHB master idle timeout !");
		reg_value = get_reg(r_CORTEX_M_USB_HS_GRSTCTL, USB_HS_GRSTCTL_AHBIDL);
		//FIXME:delay(3);
		delay_ms(3);
	} while (reg_value == 0);

	for (i = 0; i < 0xfff; i++)
		continue; /* FIXME: Wait for 3 PHY Clock (3µs) */

    log_printf("[USB HS] %s: Wait for AHB Idle: DONE\n", __FUNCTION__);
	//delay(20); /* FIXME:Wait 20ms */
	delay_ms(20);

    /* In device mode, just after Power On Reset or a Soft Reset,
     * the GINTSTS.Sof bit is set to 1'b1 for debug purposes.
     * This status must be cleared and can be ignored.
     */
    clear_reg_bits(r_CORTEX_M_USB_HS_GINTSTS, USB_HS_GINTSTS_SOF_Msk);
    __asm("DSB");

}


/**
 *\brief Device initialization.
 *
 * See section 34.17.3 of the reference manual
 * The application must perform the following steps to initialize the core as a device on powerup
 * or after a mode change from host to device.
 *
 *
 * 1. Program the following fields in the OTG_HS_DCFG register:
 *      – Device speed
 *      – Non-zero-length status OUT handshake
 *      - Periodic Frame Interval (If Periodic Endpoints are supported)
 *                       FIXME PERIODIC ENDPPOINTS NOT SUPPORTED YET
 *                       See 7.1 Device Initialization (USB 2.0 Hi-Speed On-The-Go (OTG) Programmer’s Guide)
 * 2. Program the Device threshold control register. This is required only if you are using DMA mode and
 *    you are planning to enable thresholding. /!\ NOT USED HERE

 *
 * 3. Program the OTG_HS_GINTMSK register to unmask the following interrupts:
 *      – USB reset
 *      – Enumeration done
 *      – Early suspend
 *      – USB suspend
 *      – SOF
 *
 * 4. Clear the DCTL.SftDiscon bit. The core issues a connect after this bit is cleared.
 *                      See 7.1 Device Initialization (USB 2.0 Hi-Speed On-The-Go (OTG) Programmer’s Guide)
 *
 * 5. Program the VBUSBSEN bit in the OTG_HS_GCCFG register to enable VBUS sensing
 *    in “B” device mode and supply the 5 volts across the pull-up resistor on the DP line.
 *
 * 6. Wait for the USBRST interrupt in OTG_HS_GINTSTS. It indicates that a reset has been
 *    detected on the USB that lasts for about 10 ms on receiving this interrupt.
 *
 * 7. Wait for the ENUMDNE interrupt in OTG_HS_GINTSTS. This interrupt indicates the end of
 *    reset on the USB.
 *
 * At this point, the device is ready to accept SOF packets and perform control transfers on
 * control endpoint 0.
 *
 */
void usb_otg_hs_device_init(void)
{

	/**** Restart the PHY clock *******/
	write_reg_value(r_CORTEX_M_USB_HS_PCGCCTL, 0);

	/**** Device configuration register ******/
	set_reg(r_CORTEX_M_USB_HS_DCFG, USB_HS_DCFG_PFIVL_INTERVAL_80, USB_HS_DCFG_PFIVL);

	/**** Flush the FIFOs ****/
	usb_hs_driver_TXFIFO_flush_all();
	usb_hs_driver_RXFIFO_flush();

	/**** Set the speed */
	set_reg(r_CORTEX_M_USB_HS_DCFG, USB_HS_DCFG_DSPD_HS, USB_HS_DCFG_DSPD);

