wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_hs.c
	usb_hs_driver_device_connect();

	/*** Enable the interrupts ****/
	/*** [RB]: FIXME: fix interrupts with DMA when needed ***/
	set_reg_bits(r_CORTEX_M_USB_HS_GINTMSK,
        			                USB_HS_GINTMSK_USBRST_Msk   | /* USB reset: The core sets this bit to indicate that a reset is detected on the USB. */
                                                USB_HS_GINTMSK_ENUMDNEM_Msk | /* Unmask Speed Enumeration done interupt */
                                                USB_HS_GINTMSK_ESUSPM_Msk   | /* Unmask Early suspend mask interupt */
                                                USB_HS_GINTMSK_USBSUSPM_Msk | /* Unmask USB suspend mask */
//                                                USB_HS_GINTMSK_SOFM_Msk     | /* Unmask Start of frame */
                                                USB_HS_GINTMSK_OEPINT_Msk   | /* FIXME Unmask OUT endpoints interrupt */
                                                USB_HS_GINTMSK_IEPINT_Msk   |
						USB_HS_GINTMSK_RXFLVLM_Msk);


}



static void usb_hs_init_isr_handlers(void);

/* [RB] FIXME: the hard reset of the ULPI does not seem to work with the micro-kernel
 * currently. This does not prevent USB HS to work, but this must be fixed ASAP for a
 * cleaner way of handling the USB HS state machine ...
 */
static void usb_otg_hs_ulpi_hard_reset(void)
{
	/* TODO: macros */
	log_printf("[USB HS] %s\n", __FUNCTION__);

	log_printf("[USB HS] Resetting ULPI through PE13 pin ...\n");
	/* Resetting the ULPI PHY is performed by setting the PE13 pin to 1 during
	 * some milliseconds.
	 */
	sys_cfg(CFG_GPIO_SET, (uint8_t)((('E' - 'A') << 4) + 13), 1);
	delay_ms(5);
	sys_cfg(CFG_GPIO_SET, (uint8_t)((('E' - 'A') << 4) + 13), 0);
}
static void placeholder_data_received(uint32_t dummy __attribute__((unused)))
{
}

static void placeholder_data_sent(void)
{
}

void usb_hs_driver_early_init(void (*data_received)(uint32_t), void (*data_sent)(void))
{
	if(data_sent)
          usb_hs_callbacks.data_sent_callback = data_sent;
        else
          usb_hs_callbacks.data_sent_callback = placeholder_data_sent;

        if(data_received)
	  usb_hs_callbacks.data_received_callback = data_received;
        else
	  usb_hs_callbacks.data_received_callback = placeholder_data_received;

	usb_device_early_init();

	usb_hs_init_isr_handlers();
//	NVIC_EnableIRQ(OTG_HS_IRQn);
}

/**
 * \brief Inititialize USB driver.
 *
 * Launch needeed initialization functions.
 */
void usb_hs_driver_init(void)
{
	/* First things first: reset the ULPI PHY the hard way */
	usb_otg_hs_ulpi_hard_reset();

	set_reg(r_CORTEX_M_USB_HS_GAHBCFG, 0, USB_HS_GAHBCFG_GINTMSK);
	/* Init ULPI GPIOs */

	usb_otg_hs_core_init();
	usb_otg_hs_device_init();

	set_reg(r_CORTEX_M_USB_HS_GAHBCFG, 1, USB_HS_GAHBCFG_GINTMSK);

}


/**
 * \brief Read FIFO.
 *
 * Read data put in the FIFO.
 *
 * @param dest Destination address
 * @param size Size of the data
 * @param ep Endpoint from where data is read
 */
static void _read_fifo(volatile uint8_t *dest, volatile uint32_t size, uint8_t ep)
{
	assert(ep <= 1);
	assert(size <= USB_HS_RX_FIFO_SZ);

	if((size != 0) && (dest == NULL)){
		return;
        }

	uint32_t i = 0;
	uint32_t size_4bytes = size / 4;
    uint32_t tmp;

    uint32_t oldmask = read_reg_value(r_CORTEX_M_USB_HS_GINTMSK);
    set_reg_value(r_CORTEX_M_USB_HS_GINTMSK, 0, 0xffffffff, 0);
	//disable_irq();

	for (i = 0; i < size_4bytes; i++, dest += 4){
		*(volatile uint32_t *)dest = *USB_HS_DEVICE_FIFO(ep);
	}

	switch (size % 4) {
	case 1:
		*dest = *USB_HS_DEVICE_FIFO(ep) & 0xff;
		break;
	case 2:
		*(volatile uint16_t *)dest = *USB_HS_DEVICE_FIFO(ep) & 0xffff;
		break;
	case 3:
		tmp = *USB_HS_DEVICE_FIFO(ep);
		dest[0] = tmp & 0xff;
		dest[1] = (tmp >> 8) & 0xff;
		dest[2] = (tmp >> 16) & 0xff;
		break;
	default:
		break;
	}

	//enable_irq();
    set_reg_value(r_CORTEX_M_USB_HS_GINTMSK, oldmask, 0xffffffff, 0);
}

static void read_fifo(volatile uint8_t *dest, volatile uint32_t size, uint8_t ep)
{
	unsigned int i;
	unsigned int num = size / USB_HS_RX_FIFO_SZ;

	for(i = 0; i < num; i++){
		_read_fifo(dest + (i * USB_HS_RX_FIFO_SZ), USB_HS_RX_FIFO_SZ, ep);
	}
	/* Handle the possible last packet */
	if(size > (num * USB_HS_RX_FIFO_SZ)){
		_read_fifo(dest + (num * USB_HS_RX_FIFO_SZ), size - (num * USB_HS_RX_FIFO_SZ), ep);
	}
}

/**
 * \brief Receive FIFO packet read.
 *
 */
static void usb_hs_driver_rcv_out_pkt(volatile uint8_t *buffer,
                                      volatile uint32_t *buffer_idx,
                                      volatile uint32_t buffer_size,
                                      uint32_t bcnt, usb_ep_nb_t epnum)
{
	uint32_t size;
	assert(buffer);
	assert(buffer_idx);
	size = (bcnt + *buffer_idx) >= buffer_size ? (buffer_size - *buffer_idx) : bcnt;
	read_fifo(buffer + *buffer_idx, size, epnum);
	*buffer_idx += size;
}


/*
 * IRQs
 */
void (* usb_hs_isr_handlers[USB_MAX_ISR])(void);
/**
 * \brief Handler for RXFLVL interrupt.
 *
 *   Packet read
 *   This section describes how to read packets (OUT data and SETUP packets) from the
 *   receive FIFO.
 *      1.  On catching an RXFLVL interrupt (OTG_HS_GINTSTS register), the application must
 *          read the Receive status pop register (OTG_HS_GRXSTSP).
 *      2.  The application can mask the RXFLVL interrupt (in OTG_HS_GINTSTS) by writing to
 *          RXFLVL = 0 (in OTG_HS_GINTMSK), until it has read the packet from the receive
 *          FIFO.
 *      3.  If the received packet’s byte count is not 0, the byte count amount of data is popped
 *          from the receive Data FIFO and stored in memory. If the received packet byte count is
 *          0, no data is popped from the receive data FIFO.
 *      4.  The receive FIFO’s packet status readout indicates one of the following:
 *          a) Global OUT NAK pattern:
 *              PKTSTS = Global OUT NAK, BCNT = 0x000, EPNUM = Don’t Care (0x0),
 *              DPID = Don’t Care (0b00).
 *              These data indicate that the global OUT NAK bit has taken effect.
 *          b) SETUP packet pattern:
 *              PKTSTS = SETUP, BCNT = 0x008, EPNUM = Control EP Num, DPID = D0.
 *              These data indicate that a SETUP packet for the specified endpoint is now
 *              available for reading from the receive FIFO.
 *          c) Setup stage done pattern:
 *              PKTSTS = Setup Stage Done, BCNT = 0x0, EPNUM = Control EP Num,
 *              DPID = Don’t Care (0b00).
 *              These data indicate that the Setup stage for the specified endpoint has completed
 *              and the Data stage has started. After this entry is popped from the receive FIFO,
 *              the core asserts a Setup interrupt on the specified control OUT endpoint.
 *          d) Data OUT packet pattern:
 *              PKTSTS = USB_OUT_PACKET_RECEIVED, BCNT = size of the received data OUT packet (0 ≤ BCNT
 *              ≤ 1 024), EPNUM = EPNUM on which the packet was received, DPID = Actual
 *              Data PID.
 *          e) Data transfer completed pattern:
 *              PKTSTS = Data OUT Transfer Done, BCNT = 0x0, EPNUM = OUT EP Num
 *              on which the data transfer is complete, DPID = Don’t Care (0b00).
 *              These data indicate that an OUT data transfer for the specified OUT endpoint has
 *              completed. After this entry is popped from the receive FIFO, the core asserts a
 *              Transfer Completed interrupt on the specified OUT endpoint.
 *      5.  After the data payload is popped from the receive FIFO, the RXFLVL interrupt
 *          (OTG_HS_GINTSTS) must be unmasked.
 *      6.  Steps 1–5 are repeated every time the application detects assertion of the interrupt line
 *          due to RXFLVL in OTG_HS_GINTSTS.
 *
 *      /!\ Reading an empty receive FIFO can result in undefined core behavior.
 *
 */
static void rxflvl_handler(void)
{
	uint32_t grxstsp;
	uint32_t pktsts;
	uint32_t bcnt;
	uint32_t epnum;
	uint32_t dpid;
	uint32_t size;

