wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_hs.c
   	/* 2. Mask the RXFLVL interrupt (in OTG_HS_GINTSTS) by writing to RXFLVL = 0 (in OTG_HS_GINTMSK),
     	 *    until it has read the packet from the receive FIFO
     	 */
	set_reg(r_CORTEX_M_USB_HS_GINTMSK, 0, USB_HS_GINTMSK_RXFLVLM);

 	/* 1. Read the Receive status pop register */
    	grxstsp = read_reg_value(r_CORTEX_M_USB_HS_GRXSTSP);

    	/* FIXME grxstsp content must be interprited diferently in host and device mode.
     	 *       We only support device mode so far.
     	 */
	pktsts = (grxstsp & 0x1e0000) >> 17;// FIXME we should define a macro
	dpid = (grxstsp & 0x18000) >> 15;   // FIXME we should define a macro && XXX Should dpid become a global ?
	bcnt = (grxstsp & 0x7ff0) >> 4;     // FIXME we should define a macro
	epnum = grxstsp & 0xf;       // FIXME we should define a macro
	size = 0;
	log_printf("EP:%d, PKTSTS:%x, BYTES_COUNT:%x,  DATA_PID:%x\n", epnum, pktsts, bcnt, dpid);

    /* 3. If the received packet’s byte count is not 0, the byte count amount of data is popped
     *    from the receive Data FIFO and stored in memory. If the received packet byte count is
     *    0, no data is popped from the receive data FIFO.
     *
     *   /!\ Reading an empty receive FIFO can result in undefined core behavior.
     */
    if (bcnt != ZERO_LENGTH_PACKET){

        /* 4. The receive FIFO’s packet status readout indicates one of the following: */
        switch (epnum) {
            case USB_HS_DXEPCTL_EP0:
                {
                    /* b) SETUP packet pattern
                     *      These data indicate that a SETUP packet for the specified endpoint is now
                     *      available for reading from the receive FIFO.
                     */
                    if (pktsts == SETUP && bcnt == 0x8 && dpid == 0) {
                        log_printf("EP0 Setup stage pattern\n");
                        read_fifo(setup_packet, 8, epnum);
                        /* After this, the Data stage begins.
                         * A Setup stage done is received,
                         * which triggers a Setup interrupt
                         */
                    } else {
                        /* c) Setup stage done pattern
                         *      These data indicate that the Setup stage for the specified endpoint has completed
                         *      and the Data stage has started. After this entry is popped from the receive FIFO,
                         *      the core asserts a Setup interrupt on the specified control OUT endpoint.
                         */
                        if (pktsts == SETUP_Done) {
                            log_printf("EP0 Setup stage done pattern\n");
                        } else {
                            /* d) Data OUT packet pattern */
                            if (pktsts == DataOUT) {
                                if(buffer_ep0 != NULL) {
                                    usb_hs_driver_rcv_out_pkt(buffer_ep0, &buffer_ep0_idx, buffer_ep0_size, bcnt, epnum);
                                }
                                /* In case of EP0, we have to manually check the completion and call the callback */
                                if (buffer_ep0_idx == buffer_ep0_size) {
                                    buffer_ep0 = NULL;
                                    usb_hs_callbacks.data_received_callback(buffer_ep0_idx);
                                    buffer_ep0_idx = buffer_ep0_size = 0;
                                }
                            }
                        }
                    }
                    break;
                }
            case USB_HS_DXEPCTL_EP1:
                {
                    /* Data OUT packet pattern on EP1 */
                    //bcnt > 0 here because of the previous if
                    if (bcnt>0 && pktsts == DataOUT && buffer_ep1) {
                        usb_hs_driver_rcv_out_pkt(buffer_ep1, &buffer_ep1_idx, buffer_ep1_size, bcnt, epnum);
                    }
                    break;
                }
            default:
                log_printf("RXFLVL on bad EP %d!", epnum);
        }
    }
    /* a) Global OUT NAK pattern (triggers an interrupt)
     *      These data indicate that the global OUT NAK bit has taken effect.
     */
    if (pktsts == OUT_NAK){
        log_printf("Global OUT NAK pattern on EP%d\n", epnum);
    }

    /* e) Data transfer completed pattern (triggers an interrupt)
     *      These data indicate that an OUT data transfer for the specified OUT endpoint has
     *      completed. After this entry is popped from the receive FIFO, the core asserts a
     *      Transfer Completed interrupt on the specified OUT endpoint.
     */
    if (pktsts == DataOUT){
        log_printf("OUT Data transfer completed pattern on EP%d\n", epnum);
    }
    set_reg(r_CORTEX_M_USB_HS_GINTMSK, 1, USB_HS_GINTMSK_RXFLVLM);

}


/**
 *\brief Endpoint initialization reset.
 *
 * See section 34.17.5 of the reference manual
 *
 * Endpoint initialization on USB reset
 * 1. Set the NAK bit for all OUT endpoints
 *      – SNAK = 1 in OTG_HS_DOEPCTLx (for all OUT endpoints)
 *
 * 2. Unmask the following interrupt bits
 *      – INEP0 = 1 in OTG_HS_DAINTMSK (control 0 IN endpoint)
 *      – OUTEP0 = 1 in OTG_HS_DAINTMSK (control 0 OUT endpoint)
 *      – STUP = 1 in DOEPMSK
 *      – XFRC = 1 in DOEPMSK
 *      – XFRC = 1 in DIEPMSK
 *      – TOC = 1 in DIEPMSK
 *
 * 3. Set up the Data FIFO RAM for each of the FIFOs
 *      – Program the OTG_HS_GRXFSIZ register, to be able to receive control OUT data
 *        and setup data. If thresholding is not enabled, at a minimum, this must be equal to
 *        1 max packet size of control endpoint 0 + 2 Words (for the status of the control
 *        OUT data packet) + 10 Words (for setup packets).
 *      – Program the OTG_HS_TX0FSIZ register (depending on the FIFO number chosen)
 *        to be able to transmit control IN data. At a minimum, this must be equal to 1 max
 *        packet size of control endpoint 0.
 *
 *
 * At this point, all initialization required to receive SETUP packets is done.
 *
 */
static void ep_init_reset(void)
{
 	uint8_t epnum = (read_reg_value(r_CORTEX_M_USB_HS_GRXSTSP) & 0xf);
    aprintf("reset on ep %d, init phase %d\n", epnum, usb_ctrl_is_initphase_done());
    if (epnum == 0 && usb_ctrl_is_initphase_done()) {
        /* We received an USB reset request on EP0 from the host, while
         * we are no more in enumeration state
         * In that case, as the driver has no state or knowledge of
         * the above stack specification, the reset handling is
         * passed to the libcontrol. */
        usb_ctrl_handle_reset();
    }

#if 1
    // FIXME MR We should check if the ep is IN/OUT
	set_reg(r_CORTEX_M_USB_HS_DOEPCTL(USB_HS_DXEPCTL_EP0), 1, USB_HS_DOEPCTL_SNAK);
    //set_reg(r_CORTEX_M_USB_HS_DOEPCTL(1), 1, USB_HS_DOEPCTL_SNAK);
#else
    /* 1. Set the NAK bit for all OUT endpoints
     *      – SNAK = 1 in OTG_HS_DOEPCTLx (for all OUT endpoints)
     */
    uint8_t i = 0;
    for (i=0;i<=PROD_MAX_USB_ENDPOINTS;i++){
        set_reg(r_CORTEX_M_USB_HS_DOEPCTL(i), 1, USB_HS_DOEPCTL_SNAK);
    }
#endif

