wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_hs.c
    /*
     * 2. Unmask the following interrupt bits
     *      – INEP0 = 1 in OTG_HS_DAINTMSK (control 0 IN endpoint)
     *      – OUTEP0 = 1 in OTG_HS_DAINTMSK (control 0 OUT endpoint)
     *      – STUP = 1 in DOEPMSK
     *      – XFRC = 1 in DOEPMSK
     *      – XFRC = 1 in DIEPMSK
     *      – TOC = 1 in DIEPMSK
     */

	write_reg_value(r_CORTEX_M_USB_HS_DAINTMSK,	USB_HS_DAINTMSK_IEPM(USB_HS_DXEPCTL_EP0)
                                                | USB_HS_DAINTMSK_IEPM(USB_HS_DXEPCTL_EP2)
                                                | USB_HS_DAINTMSK_OEPM(USB_HS_DXEPCTL_EP0)
                                                | USB_HS_DAINTMSK_OEPM(USB_HS_DXEPCTL_EP1));

	set_reg(r_CORTEX_M_USB_HS_DOEPMSK, 1, USB_HS_DOEPMSK_STUPM);
	set_reg(r_CORTEX_M_USB_HS_DOEPMSK, 1, USB_HS_DOEPMSK_XFRCM);
	set_reg(r_CORTEX_M_USB_HS_DIEPMSK, 1, USB_HS_DIEPMSK_XFRCM);
	set_reg(r_CORTEX_M_USB_HS_DIEPMSK, 1, USB_HS_DIEPMSK_TOM);



	/*
	 * 3. Set up the Data FIFO RAM for each of the FIFOs
	 *      – Program the OTG_HS_GRXFSIZ register, to be able to receive control OUT data
	 *        and setup data. If thresholding is not enabled, at a minimum, this must be equal to
	 *        1 max packet size of control endpoint 0 + 2 Words (for the status of the control
	 *        OUT data packet) + 10 Words (for setup packets).
	 *
	 * See reference manual section 34.11 for peripheral FIFO architecture.
	 * XXX: The sizes of TX FIFOs seems to be the size of TX FIFO #0 for
	 * all FIFOs. We don't know if it is really the case or if the DTXFSTS
	 * register does not give the free space for the right FIFO.
	 *
	 * 0                512                1024
	 * +-----------------+------------------+-----------------+
	 * |     RX FIFO     |     TX0 FIFO     | TX1 FIFO (EP 2) |
	 * |    128 Words    |    128 Words     |    128 Words    |
	 * +-----------------+------------------+-----------------+
	 *
	 */
	set_reg(r_CORTEX_M_USB_HS_GRXFSIZ, USB_HS_RX_FIFO_SZ, USB_HS_GRXFSIZ_RXFD);

	/*      – Program the OTG_HS_TX0FSIZ register (depending on the FIFO number chosen)
	 *        to be able to transmit control IN data. At a minimum, this must be equal to 1 max
	 *        packet size of control endpoint 0.
	 *
	 *      XXX: The register 'Enpoint 0 Transmit FIFO size' is called OTG_HS_TX0FSIZ in
	 *            section 34.17.5 of the reference manual but it is called OTG_HS_DIEPTXF0 in the section 34.16.2.
	 */

 	/*
	 * EndPoint 0 TX FIFO configuration (should store a least 4 64byte paquets
	 */
	set_reg(r_CORTEX_M_USB_HS_DIEPTXF0, USB_HS_TX_FIFO_SZ, USB_HS_DIEPTXF_INEPTXSA);
	set_reg(r_CORTEX_M_USB_HS_DIEPTXF0, USB_HS_TX_FIFO_SZ, USB_HS_DIEPTXF_INEPTXFD);

	/*
	 * 4. Program STUPCNT in the endpoint-specific registers for control OUT endpoint 0 to receive a SETUP packet
	 *      – STUPCNT = 3 in OTG_HS_DOEPTSIZ0 (to receive up to 3 back-to-back SETUP packets)
	 */

	set_reg(r_CORTEX_M_USB_HS_DOEPTSIZ(USB_HS_DXEPCTL_EP0), 3, USB_HS_DOEPTSIZ_STUPCNT);
	set_reg(r_CORTEX_M_USB_HS_DOEPCTL(USB_HS_DXEPCTL_EP0), 1, USB_HS_DOEPCTL_CNAK);
	set_reg(r_CORTEX_M_USB_HS_DOEPCTL(USB_HS_DXEPCTL_EP0), 1, USB_HS_DOEPCTL_EPENA);

	/*********** Set endpoints 0x82 (IN EP) ************/
#if 0
	usb_driver_in_endpoint_activate(USB_HS_DXEPCTL_EP2,(64 * 4 + 128 * 4), USB_HS_DXEPCTL_EPTYP_BULK, USB_HS_DIEPCTL_SD0PID, 64);
#else
	/*  Transmit FIFO address */
	/* FIXME TxFIFO number */
	set_reg(r_CORTEX_M_USB_HS_DIEPTXF(USB_HS_DXEPCTL_EP2), USB_HS_RX_FIFO_SZ + USB_HS_TX_FIFO_SZ, USB_HS_DIEPTXF_INEPTXSA);
	set_reg(r_CORTEX_M_USB_HS_DIEPTXF(USB_HS_DXEPCTL_EP2), USB_HS_TX_FIFO_SZ, USB_HS_DIEPTXF_INEPTXFD);

	/* Maximum packet size */
	set_reg_value(r_CORTEX_M_USB_HS_DIEPCTL(USB_HS_DXEPCTL_EP2), MAX_DATA_PACKET_SIZE(USB_HS_DXEPCTL_EP2), USB_HS_DIEPCTL_MPSIZ_Msk(USB_HS_DXEPCTL_EP2), USB_HS_DIEPCTL_MPSIZ_Pos(USB_HS_DXEPCTL_EP2));

	/* Start data toggle */
 	set_reg(r_CORTEX_M_USB_HS_DOEPCTL(USB_HS_DXEPCTL_EP2), 1, USB_HS_DIEPCTL_SD0PID);

	/* Endpoint type */
	set_reg(r_CORTEX_M_USB_HS_DIEPCTL(USB_HS_DXEPCTL_EP2), USB_HS_DIEPCTL_EPTYP_BULK, USB_HS_DIEPCTL_EPTYP);

	/*  USB active endpoint XXX: should it be done after a SET_CONFIGURATION ? */
	set_reg_bits(r_CORTEX_M_USB_HS_DIEPCTL(USB_HS_DXEPCTL_EP2), USB_HS_DIEPCTL_USBAEP_Msk);

#endif



	/************ Set endpoint 0x1 (OUT EP) ************/
#if 0
    usb_driver_out_endpoint_activate(USB_HS_DXEPCTL_EP1, //FIFO NUM, USB_HS_DXEPCTL_EPTYP_BULK, USB_HS_DOEPCTL_SD0PID, 64);
#else

 	/* Maximum packet size */
	set_reg_value(r_CORTEX_M_USB_HS_DOEPCTL(USB_HS_DXEPCTL_EP1), MAX_DATA_PACKET_SIZE(USB_HS_DXEPCTL_EP1), USB_HS_DOEPCTL_MPSIZ_Msk(USB_HS_DXEPCTL_EP1), USB_HS_DOEPCTL_MPSIZ_Pos(USB_HS_DXEPCTL_EP1));

	/* FIXME Start data toggle */
	set_reg(r_CORTEX_M_USB_HS_DOEPCTL(USB_HS_DXEPCTL_EP1), 1, USB_HS_DOEPCTL_SD0PID);

	/* Endpoint type */
	set_reg(r_CORTEX_M_USB_HS_DOEPCTL(USB_HS_DXEPCTL_EP1), USB_HS_DOEPCTL_EPTYP_BULK, USB_HS_DOEPCTL_EPTYP);

	/*  USB active endpoint */
	set_reg_bits(r_CORTEX_M_USB_HS_DOEPCTL(USB_HS_DXEPCTL_EP1), USB_HS_DOEPCTL_USBAEP_Msk);

#endif
}


/**
 * \brief Endpoint initialization on enumeration completion.
 *
 *  1. On the Enumeration Done interrupt (ENUMDNE in OTG_HS_GINTSTS), read the OTG_HS_DSTS register
 *     to determine the enumeration speed.
 *  2. Program the MPSIZ field in OTG_HS_DIEPCTL0 to set the maximum packet size. This
 *     step configures control endpoint 0. The maximum packet size for a control endpoint
 *     depends on the enumeration speed.
 *
 *  At this point, the device is ready to receive SOF packets and is configured to perform control
 *  transfers on control endpoint 0
 */
static void ep_init_enum(void)
{
	/* 1. read the OTG_HS_DSTS register to determine the enumeration speed. */
	uint8_t speed = get_reg(r_CORTEX_M_USB_HS_DSTS, USB_HS_DSTS_ENUMSPD);
	if (speed != USB_HS_DSTS_ENUMSPD_HS) {
		log_printf("Wrong enum speed !\n");
		return;
	}

    /* TODO Program the MPSIZ field in OTG_HS_DIEPCTL0 to set the maximum packet size. This
     * step configures control endpoint 0.
     */
	set_reg_value(r_CORTEX_M_USB_HS_DIEPCTL(USB_HS_DXEPCTL_EP0),
		      USB_HS_DIEPCTL0_MPSIZ_64BYTES,
		      USB_HS_DIEPCTL_MPSIZ_Msk(USB_HS_DXEPCTL_EP0),
		      USB_HS_DIEPCTL_MPSIZ_Pos(USB_HS_DXEPCTL_EP0));
}


/**
 * \brief Input interrupt handler.
 *
 * Handles an input interrupt.
 * The peripheral core provides the following status checks and interrupt generation:
 * • Transfer completed interrupt, indicating that data transfer was completed on both the application (AHB) and USB sides
 * • Setup stage has been done (control-out only)
 * • Associated transmit FIFO is half or completely empty (in endpoints)
 * • NAK acknowledge has been transmitted to the host (isochronous-in only)
 * • IN token received when Tx-FIFO was empty (bulk-in/interrupt-in only)
 * • Out token received when endpoint was not yet enabled
 * • Babble error condition has been detected
 * • Endpoint disable by application is effective
 * • Endpoint NAK by application is effective (isochronous-in only)
 * • More than 3 back-to-back setup packets were received (control-out only)
 * • Timeout condition detected (control-in only)
 * • Isochronous out packet has been dropped, without generating an interrupt
 */
static volatile unsigned int ep0_last_packet_sent = 0;
static volatile unsigned int ep0_packets_sent = 0;
static void iepint_handler(void)
{
    /*  read the device all endpoints interrupt (OTG_HS_DAINT) register to get the exact endpoint number
     *  for the Device endpoint-x interrupt register.
     */
	uint32_t daint = read_reg_value(r_CORTEX_M_USB_HS_DAINT);
	if (daint & USB_HS_DAINT_IEPINT(USB_HS_DXEPCTL_EP0)) {
		uint32_t diepint0 = read_reg_value(r_CORTEX_M_USB_HS_DIEPINT(USB_HS_DXEPCTL_EP0));
        /* Bit 7 TXFE: Transmit FIFO empty */
		if (diepint0 & USB_HS_DIEPINT_TOC_Msk) {
			set_reg_bits(r_CORTEX_M_USB_HS_DIEPINT(USB_HS_DXEPCTL_EP0), USB_HS_DIEPINT_TXFE_Msk);
		}

        /* Bit 6 INEPNE: IN endpoint NAK effective */
		if (diepint0 & USB_HS_DIEPINT_INEPNE_Msk) {
			set_reg_bits(r_CORTEX_M_USB_HS_DIEPINT(USB_HS_DXEPCTL_EP0), USB_HS_DIEPINT_INEPNE_Msk);
		}

        /* Bit 4 ITTXFE: IN token received when TxFIFO is empty */
		if (diepint0 & USB_HS_DIEPINT_ITTXFE_Msk) {
			set_reg_bits(r_CORTEX_M_USB_HS_DIEPINT(USB_HS_DXEPCTL_EP0), USB_HS_DIEPINT_ITTXFE_Msk);
		}

