wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_hs.c
        /* Bit 3 TOC: Timeout condition */
		if (diepint0 & USB_HS_DIEPINT_TOC_Msk) {
			set_reg_bits(r_CORTEX_M_USB_HS_DIEPINT(USB_HS_DXEPCTL_EP0), USB_HS_DIEPINT_TOC_Msk);
		}

        /* bit 1 EPDISD: Endpoint disabled interrupt */
		if (diepint0 & USB_HS_DIEPINT_EPDISD_Msk) {
			set_reg_bits(r_CORTEX_M_USB_HS_DIEPINT(USB_HS_DXEPCTL_EP0), USB_HS_DIEPINT_EPDISD_Msk);
            /* Now the endpiont is really disabled
             * We should update enpoint status
             */
		}

        /* Bit 0 XFRC: Transfer completed interrupt */
        if (diepint0 & USB_HS_DIEPINT_XFRC_Msk) {
            set_reg_bits(r_CORTEX_M_USB_HS_DIEPINT(USB_HS_DXEPCTL_EP0), USB_HS_DIEPINT_XFRC_Msk);
            ep0_packets_sent = 1;
            /* Our callback */
            if (ep0_last_packet_sent == 1){
                usb_hs_callbacks.data_sent_callback();
            }
        }
    }

	if (daint & USB_HS_DAINT_IEPINT(USB_HS_DXEPCTL_EP2)) {
		uint32_t diepint2 = read_reg_value(r_CORTEX_M_USB_HS_DIEPINT(USB_HS_DXEPCTL_EP2));

        /* Bit 7 TXFE: Transmit FIFO empty */
		if (diepint2 & USB_HS_DIEPINT_TOC_Msk) {
			set_reg_bits(r_CORTEX_M_USB_HS_DIEPINT(USB_HS_DXEPCTL_EP2), USB_HS_DIEPINT_TXFE_Msk);
		}

        /* Bit 6 INEPNE: IN endpoint NAK effective */
		if (diepint2 & USB_HS_DIEPINT_INEPNE_Msk) {
			set_reg_bits(r_CORTEX_M_USB_HS_DIEPINT(USB_HS_DXEPCTL_EP2), USB_HS_DIEPINT_INEPNE_Msk);
		}

        /* Bit 4 ITTXFE: IN token received when TxFIFO is empty */
		if (diepint2 & USB_HS_DIEPINT_ITTXFE_Msk) {
			set_reg_bits(r_CORTEX_M_USB_HS_DIEPINT(USB_HS_DXEPCTL_EP2), USB_HS_DIEPINT_ITTXFE_Msk);
		}

        /* Bit 3 TOC: Timeout condition */
		if (diepint2 & USB_HS_DIEPINT_TOC_Msk) {
			set_reg_bits(r_CORTEX_M_USB_HS_DIEPINT(USB_HS_DXEPCTL_EP2), USB_HS_DIEPINT_TOC_Msk);
		}

        /* bit 1 EP2DISD: Endpoint disabled interrupt */
		if (diepint2 & USB_HS_DIEPINT_EPDISD_Msk) {
			set_reg_bits(r_CORTEX_M_USB_HS_DIEPINT(USB_HS_DXEPCTL_EP2), USB_HS_DIEPINT_EPDISD_Msk);
		}

        /* Bit 2 XFRC: Transfer completed interrupt */
        if (diepint2 & USB_HS_DIEPINT_XFRC_Msk) {
            set_reg_bits(r_CORTEX_M_USB_HS_DIEPINT(USB_HS_DXEPCTL_EP2), USB_HS_DIEPINT_XFRC_Msk);
            usb_hs_callbacks.data_sent_callback();
        }

    }

	set_reg(r_CORTEX_M_USB_HS_GINTMSK, 1, USB_HS_GINTMSK_IEPINT);
}


/**
 * \brief Output interrupt handler.
 *
 * Handles an output interrupt. Fill setup packet if on EP0.
 * If data on EP0, handles by DFU functions (only mode where
 * data is transfered on EP0)
 * Else handles data on EPx.
 */
static void oepint_handler(void)
{
	uint32_t daint = read_reg_value(r_CORTEX_M_USB_HS_DAINT);

    if (daint & USB_HS_DAINT_OEPINT(USB_HS_DXEPCTL_EP0)) {
        uint32_t doepint0 = read_reg_value(r_CORTEX_M_USB_HS_DOEPINT(USB_HS_DXEPCTL_EP0));
        if (doepint0 & USB_HS_DOEPINT_STUP_Msk) {
            /* We can process the received SETUP Packet (RM0090 p1357) */
            set_reg_bits(r_CORTEX_M_USB_HS_DOEPINT(USB_HS_DXEPCTL_EP0), USB_HS_DOEPINT_STUP_Msk);
            struct usb_setup_packet stp_packet = {
                setup_packet[0],
                setup_packet[1],
                setup_packet[3] << 8 | setup_packet[2],
                setup_packet[5] << 8 | setup_packet[4],
                setup_packet[7] << 8 | setup_packet[6]
            };
            /* Inform the upper layer that a setup packet is available */
            usb_ctrl_handler(&stp_packet);
        }
        if (doepint0 & USB_HS_DOEPINT_XFRC_Msk) {
            set_reg_bits(r_CORTEX_M_USB_HS_DOEPINT(USB_HS_DXEPCTL_EP0), USB_HS_DOEPINT_XFRC_Msk);
        }
    }
    if (daint & USB_HS_DAINT_OEPINT(USB_HS_DXEPCTL_EP1)) {
        uint32_t doepint1 = read_reg_value(r_CORTEX_M_USB_HS_DOEPINT(USB_HS_DXEPCTL_EP1));
        if (doepint1 & USB_HS_DOEPINT_XFRC_Msk) {
            set_reg_bits(r_CORTEX_M_USB_HS_DOEPINT(USB_HS_DXEPCTL_EP1), USB_HS_DOEPINT_XFRC_Msk);
            set_reg_bits(r_CORTEX_M_USB_HS_DOEPCTL(USB_HS_DXEPCTL_EP1), USB_HS_DOEPCTL_SNAK_Msk); // WHERE in the datasheet ? In disabling an OUT ep (p1360)
            buffer_ep1 = NULL;
            usb_hs_callbacks.data_received_callback(buffer_ep1_idx);
            set_reg_bits(r_CORTEX_M_USB_HS_DOEPCTL(USB_HS_DXEPCTL_EP0), USB_HS_DOEPCTL_CNAK_Msk);
            buffer_ep1_idx = 0;
        }
	}

	set_reg(r_CORTEX_M_USB_HS_GINTMSK, 1, USB_HS_GINTMSK_OEPINT);
}

/**
 * \brief Handles an unknown interrupt.
 */

static void default_handler(void)
{

}

#if CONFIG_WOOKEY
/**
 * \brief Manage IRQ handler calls.
 *
 * IRQ Handlers as defined in startup_stm32f4xx.s
 */
void OTG_HS_IRQHandler(uint8_t irq __UNUSED, // IRQ number
                       uint32_t sr,  // content of posthook.status,
                       uint32_t dr)  // content of posthook.data)

{
	uint8_t i;
	uint32_t intsts = sr;
	uint32_t intmsk = dr;

	if (intsts & USB_HS_GINTSTS_CMOD_Msk){
		log_printf("[USB FS] Int in Host mode !\n");
	}
    uint32_t val = intsts;
    val &= intmsk;

	for (i = 0; val; i++,val>>=1) {
		/* Below code is equivalent to
         * calculating (!(intsts & ((uint32_t)1 << i)) || !(intmsk & ((uint32_t)1 << i)))
         */
        if (val & 1)
        {
            usb_hs_isr_handlers[i]();
        }
    }
}
#endif

static void usb_power_on(void){
 	log_printf("[USB HS] %s\n", __FUNCTION__);
	log_printf("[USB HS] %s: Setup Device configuration register DCFG\n", __FUNCTION__);
	set_reg(r_CORTEX_M_USB_HS_DCFG, USB_HS_DCFG_PFIVL_INTERVAL_80, USB_HS_DCFG_PFIVL);
	set_reg(r_CORTEX_M_USB_HS_DCFG, USB_HS_DCFG_DSPD_HS, USB_HS_DCFG_DSPD);
	set_reg_bits(r_CORTEX_M_USB_HS_DCFG, USB_HS_DCFG_NZLSOHSK_Msk);
}

/**
 * \brief Init ISR handler vector.
 */
static void usb_hs_init_isr_handlers(void)
{
#define X(interrupt, handler) (usb_hs_isr_handlers[interrupt] = handler)
    X(USB_HS_GINTSTS_CMOD_Pos, default_handler);                   /* 0  CMOD    : Current mode of operation */
    X(USB_HS_GINTSTS_MMIS_Pos, default_handler);                   /* 1  MMIS    : Mode mismatch interrupt */
    X(USB_HS_GINTSTS_OTGINT_Pos, default_handler);                 /* 2  OTGINT  : OTG interrupt */
    X(USB_HS_GINTSTS_SOF_Pos, default_handler);                    /* 3  SOF     : Start of frame */
    X(USB_HS_GINTSTS_RXFLVL_Pos, rxflvl_handler);       /* 4  RXFLVL  : RxFIFO non-empty */
    X(USB_HS_GINTSTS_NPTXFE_Pos, default_handler);                 /* 5  NPTXFE  : Non-periodic TxFIFO empty (HOST MODE ONLY) */
    X(USB_HS_GINTSTS_GINAKEFF_Pos, default_handler);               /* 6  GINAKEFF: Global IN non-periodic NAK effective */
    X(USB_HS_GINTSTS_GOUTNAKEFF_Pos, default_handler);             /* 7  GONAKEFF: Global OUT NAK effective */
    X(8, default_handler);                                         /* 8  Reserved */
    X(9, default_handler);                                         /* 7  Reserved */
    X(USB_HS_GINTSTS_ESUSP_Pos, default_handler);                  /* 10 ESUSP   : Early suspend */
    X(USB_HS_GINTSTS_USBSUSP_Pos, default_handler);                /* 11 USBSUSP : USB suspend */
    X(USB_HS_GINTSTS_USBRST_Pos, ep_init_reset);        /* 12 USBRST  : USB reset */
    X(USB_HS_GINTSTS_ENUMDNE_Pos, ep_init_enum);        /* 13 ENUMDNE : Speed Enumeration done */
    X(USB_HS_GINTSTS_ISOODRP_Pos, default_handler);                /* 14 ISOODRP : Isochronous OUT packet dropped interrupt */
    X(USB_HS_GINTSTS_EOPF_Pos, default_handler);                   /* 15 EOPF    : End of periodic frame interrupt */
    X(16, default_handler);                                        /* 16 Reserved */
    X(USB_HS_GINTSTS_EPMISM_Pos, default_handler);                 /* 17 EPMISM  : Endpoint mismatch interrupt */
    X(USB_HS_GINTSTS_IEPINT_Pos, iepint_handler);       /* 18 IEPINT  : IN endpoint interrupt */
    X(USB_HS_GINTSTS_OEPINT_Pos, oepint_handler);       /* 19 OEPINT  : OUT endpoint interrupt */
    X(USB_HS_GINTSTS_IISOIXFR_Pos, default_handler);               /* 20 IISOIXFR: Incomplete isochronous IN transfer */
    X(USB_HS_GINTSTS_IPXFR_Pos, default_handler);                  /* 21 IPXFR   : Incomplete periodic transfer */
    X(22, default_handler);                                        /* 22 Reserved */
    X(23, default_handler);                                        /* 23 Reserved */
    X(USB_HS_GINTSTS_HPRTINT_Pos, default_handler);                /* 24 HPRTINT : Host port interrupt (HOST MODE ONLY) */
    X(USB_HS_GINTSTS_HCINT_Pos, default_handler);                  /* 25 HCINT   : Host channels interrupt (HOST MODE ONLY) */
    X(USB_HS_GINTSTS_PTXFE_Pos, default_handler);                  /* 26 PTXFE   : Periodic TxFIFO empty (HOST MODE ONLY) */
    X(27, default_handler);                                        /* 27 Reserved */
    X(USB_HS_GINTSTS_CIDSCHG_Pos, default_handler);                /* 28 CIDSCHG : Connector ID status change */
    X(USB_HS_GINTSTS_DISCINT_Pos, default_handler);                /* 29 DISCINT : Disconnect detected interrupt (HOST MODE ONLY)*/
    X(USB_HS_GINTSTS_SRQINT_Pos, usb_power_on);                 /* 30 SRQINT  : Session request/new session detected interrupt */
    X(USB_HS_GINTSTS_WKUPINT_Pos, default_handler);                /* 31 WKUPINT : Resume/remote wakeup detected interrupt */
#undef X
}

/**
 * \brief function to write data on FIFO
 *
 * The application must ensure that at least one free space is available in the periodic/non-periodic
 * request queue before starting to write to the transmit FIFO.
 * The application must always write to the transmit FIFO in DWORDs.
 *      If the packet size is non-DWORD aligned, the application must use padding.
 * The OTG_FS host determines the actual packet size based on the programmed maximum packet size and transfer size.
 *
 * @param src Source adress
 * @param size Size of data
 * @param ep Endpoint used
 */
static void _write_fifo(const void *src, uint32_t size, uint8_t ep)
{
	uint32_t size_4bytes = size / 4;
	uint32_t needed_words = size / 4 + (size & 3 ? 1 : 0);
    uint32_t tmp;
	uint32_t i;

     if((size != 0) && (src == NULL)){
           return;
     }

    if (needed_words > USB_HS_TX_FIFO_SZ){
        log_printf("needed_words > %d", USB_HS_TX_FIFO_SZ);
    }

    while (get_reg(r_CORTEX_M_USB_HS_DTXFSTS(ep), USB_HS_DTXFSTS_INEPTFSAV) < needed_words){
        /* Are we suspended? */
        if(get_reg(r_CORTEX_M_USB_HS_DSTS, USB_HS_DSTS_SUSPSTS)){
            return;
        }
    }

    // FIXME: IP should has its own interrupts disable during ISR execution
    uint32_t oldmask = read_reg_value(r_CORTEX_M_USB_HS_GINTMSK);
    set_reg_value(r_CORTEX_M_USB_HS_GINTMSK, 0, 0xffffffff, 0);
    //disable_irq();

    for (i = 0; i < size_4bytes; i++, src += 4){
        write_reg_value(USB_HS_DEVICE_FIFO(ep), *(uint32_t *)src);
    }
    switch (size & 3) {
        case 1:
            write_reg_value(USB_HS_DEVICE_FIFO(ep), *(uint8_t *)src);
            break;
        case 2:
            write_reg_value(USB_HS_DEVICE_FIFO(ep), *(uint16_t *)src);
            break;
        case 3:
            tmp  = ((uint8_t*) src)[0];
            tmp |= ((uint8_t*) src)[1] << 8;
            tmp |= ((uint8_t*) src)[2] << 16;
            write_reg_value(USB_HS_DEVICE_FIFO(ep), tmp);
            break;
        default:
            break;
    }

    // FIXME: IP should has its own interrupts disable during ISR execution
    //enable_irq();
    set_reg_value(r_CORTEX_M_USB_HS_GINTMSK, oldmask, 0xffffffff, 0);
}


