wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_hs.c
/* Split the data to send in max TXFIFO size packets */
static void write_fifo(const void *src, uint32_t size, uint8_t ep)
{
	unsigned int i;
	unsigned int num = size / USB_HS_TX_FIFO_SZ;

	for(i = 0; i < num; i++) {
		_write_fifo(src + (i * USB_HS_TX_FIFO_SZ), USB_HS_TX_FIFO_SZ, ep);
	}
	/* Handle the possible last packet */
	if(size > (num * USB_HS_TX_FIFO_SZ)) {
		_write_fifo(src + (num * USB_HS_TX_FIFO_SZ), size - (num * USB_HS_TX_FIFO_SZ), ep);
	}

}

void usb_hs_driver_send_zlp(uint8_t ep){

    /* 1. Program the OTG_HS_DIEPTSIZx register for the transfer size and the corresponding packet count. */
    set_reg_value(r_CORTEX_M_USB_HS_DIEPTSIZ(ep), 1, USB_HS_DIEPTSIZ_PKTCNT_Msk(ep), USB_HS_DIEPTSIZ_PKTCNT_Pos(ep));
    set_reg_value(r_CORTEX_M_USB_HS_DIEPTSIZ(ep), 0, USB_HS_DIEPTSIZ_XFRSIZ_Msk(ep), USB_HS_DIEPTSIZ_XFRSIZ_Pos(ep));

    /* 2. Enable endpoint for transmission. */
    set_reg_bits(r_CORTEX_M_USB_HS_DIEPCTL(ep), USB_HS_DIEPCTL_CNAK_Msk | USB_HS_DIEPCTL_EPENA_Msk);

}

/**
 * \brief Function to handle send call.
 *
 * Set register correctly for the device to send data to host next.
 * This is NOT where the actual sending is done.
 *
 * @param src Source adress
 * @param size Size of data
 * @param ep Endpoint used
 */
static void _usb_hs_driver_send(const void *src, uint32_t size, uint8_t ep)
{
    uint32_t packet_count = 0;
    /* FIXME Only sending data from IN endpoints is implemented */
    if (src == NULL){
        usb_hs_driver_send_zlp(ep);
        return;
    }
    /* Program the transfer size and packet count as follows:
     *      xfersize = N * maxpacket + short_packet pktcnt = N + (short_packet exist ? 1 : 0)
     */
    packet_count = (size / MAX_DATA_PACKET_SIZE(ep)) + (size & (MAX_DATA_PACKET_SIZE(ep)-1) ? 1 : 0);

    /* 1. Program the OTG_HS_DIEPTSIZx register for the transfer size and the corresponding packet count. */
    set_reg_value(r_CORTEX_M_USB_HS_DIEPTSIZ(ep), packet_count, USB_HS_DIEPTSIZ_PKTCNT_Msk(ep), USB_HS_DIEPTSIZ_PKTCNT_Pos(ep));
    set_reg_value(r_CORTEX_M_USB_HS_DIEPTSIZ(ep), size, USB_HS_DIEPTSIZ_XFRSIZ_Msk(ep), USB_HS_DIEPTSIZ_XFRSIZ_Pos(ep));

    /* 2. Enable endpoint for transmission. */
    set_reg_bits(r_CORTEX_M_USB_HS_DIEPCTL(ep), USB_HS_DIEPCTL_CNAK_Msk | USB_HS_DIEPCTL_EPENA_Msk);


   /* The application can write multiple packets for the same
    * endpoint into the transmit FIFO, if space is available.
    * /!\ FIXME For periodic IN endpoints, the application must
    *     write packets only for one microframe.
    *     It can write packets for the next periodic transaction
    *     only after getting transfer complete for the previous transaction.
    */
    write_fifo(src, size, ep);
    /* Are we suspended */
    if(get_reg(r_CORTEX_M_USB_HS_DSTS, USB_HS_DSTS_SUSPSTS)) {
        return;
    }
    //FIXME activate TXEMPTY intrrupt in DIEPEMPMSK register
}

void usb_hs_driver_send(const void *src, uint32_t size, uint8_t ep)
{
	/* FIXME/TODO: it would be cleaner to monitor TXEMPTY here */
	if((ep == USB_HS_DXEPCTL_EP0) && (src != NULL)) {
		/* Special handling for EP0 to split sending across multiple packets */
        unsigned int i;
        uint32_t packet_count = 0;
        packet_count = size / MAX_DATA_PACKET_SIZE(ep);
        ep0_last_packet_sent = 0;
        for(i = 0; i < packet_count; i++) {
            if((size == (packet_count * MAX_DATA_PACKET_SIZE(ep))) && (i == packet_count-1)) {
                ep0_last_packet_sent = 1;
            }
            ep0_packets_sent = 0;
            _usb_hs_driver_send(src+(i*MAX_DATA_PACKET_SIZE(ep)), MAX_DATA_PACKET_SIZE(ep), ep);
            if(((size == (packet_count * MAX_DATA_PACKET_SIZE(ep))) && (i != packet_count-1)) ||
                (size != (packet_count * MAX_DATA_PACKET_SIZE(ep))))
            {
                /* For all the intermediate packets except the last one:
                 * wait with host hang up detection
                 */
                while (ep0_packets_sent == 0) {
                    /* Are we suspended? */
                    if(get_reg(r_CORTEX_M_USB_HS_DSTS, USB_HS_DSTS_SUSPSTS)){
                        break;
                    }
                }
            }
        }
        if(size != (packet_count * MAX_DATA_PACKET_SIZE(ep))) {
            /* Residual data to send */
            ep0_last_packet_sent = 1;
            _usb_hs_driver_send(src+(packet_count*MAX_DATA_PACKET_SIZE(ep)), size - (packet_count*MAX_DATA_PACKET_SIZE(ep)), ep);
        }
        if(packet_count > 0) {
            set_reg_bits(r_CORTEX_M_USB_HS_DOEPCTL(USB_HS_DXEPCTL_EP0), USB_HS_DOEPCTL_CNAK_Msk);
        }
    }
    else if ((ep == USB_HS_DXEPCTL_EP0) && (src == NULL)) {
        ep0_last_packet_sent = 1;
        _usb_hs_driver_send(src, size, ep);
    } else {
        _usb_hs_driver_send(src, size, ep);
    }
    /* If we are suspended, call ourself the callback and flush stuff */
    if(get_reg(r_CORTEX_M_USB_HS_DSTS, USB_HS_DSTS_SUSPSTS)) {
        usb_hs_driver_TXFIFO_flush_all();
        usb_hs_callbacks.data_sent_callback();
    }
}

/**
 * \brief Function to handle read call.
 *
 * Set register correctly for the device to read data from host next.
 * This is NOT where the actual reading is done.
 *
 * @param src Source adress
 * @param size Size of data
 * @param ep Endpoint used
 */
void usb_hs_driver_read(void *dst, uint32_t size, uint8_t ep)
{
	if (ep == USB_HS_DXEPCTL_EP0 && dst != NULL) {
		/* For EP0, we have to monitor each packet since we are limited to 64 bytes for data */
        	assert(dst);
		assert(!buffer_ep0);
		buffer_ep0 = dst;
		buffer_ep0_idx = 0;
		buffer_ep0_size = size;
		/* No need to trigger a oepint interrupt here, since we are limited to 64 bytes packets anyways ...
		 * Handling the completion in rxflvl is a better choice.
		 */
	}
	if (ep == USB_HS_DXEPCTL_EP0 && dst == NULL) {
		buffer_ep0 = NULL;
		buffer_ep0_idx = buffer_ep0_size = 0;
		/* No need to trigger a oepint interrupt here, since we are limited to 64 bytes packets anyways ...
		 * Handling the completion in rxflvl is a better choice.
		 */
	}
	if (ep == USB_HS_DXEPCTL_EP1) {
		if (dst != NULL) {
			assert(dst);
			assert(!buffer_ep1);
			buffer_ep1 = dst;
			buffer_ep1_idx = 0;
			buffer_ep1_size = size;
		} else {
			buffer_ep1 = NULL;
			buffer_ep1_idx = buffer_ep1_size = 0;
		}
		/* Set the packet count number in the PKTCNT field */
		uint32_t packet_count = size / MAX_DATA_PACKET_SIZE(ep) + (size & (MAX_DATA_PACKET_SIZE(ep)-1) ? 1 : 0);
		set_reg_value(r_CORTEX_M_USB_HS_DOEPTSIZ(ep), packet_count, USB_HS_DOEPTSIZ_PKTCNT_Msk(ep), USB_HS_DOEPTSIZ_PKTCNT_Pos(ep));
		/* Set the size in the XFRSIZ field */
		set_reg_value(r_CORTEX_M_USB_HS_DOEPTSIZ(ep), size, USB_HS_DOEPTSIZ_XFRSIZ_Msk(ep), USB_HS_DOEPTSIZ_XFRSIZ_Pos(ep));

	}
	set_reg_bits(r_CORTEX_M_USB_HS_DOEPCTL(ep), USB_HS_DOEPCTL_CNAK_Msk);
}

/**
 * \brief Set adress.
 */
void usb_hs_driver_set_address(uint16_t addr)
{
	set_reg(r_CORTEX_M_USB_HS_DCFG, addr, USB_HS_DCFG_DAD);
}

#endif
